Revit 2026 API

# ApplicationIsMechanicalAnalysisEnabled Property

---

Checks whether or not mechanical analysis is enabled, and enable or disable it.

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsMechanicalAnalysisEnabled { get; set; }
```
```vb
Public Property IsMechanicalAnalysisEnabled As Boolean
	Get
	Set
```
```cpp
public:
property bool IsMechanicalAnalysisEnabled {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IsMechanicalAnalysisEnabled : bool with get, set
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | When setting this property: The current product type is not ProductType.Revit and discipline controls are not enabled. |

Enabling mechanical analysis will not take effect unless the mechanical discipline is also enabled.

#### Reference

Application Class

Autodesk.Revit.ApplicationServices Namespace